
local 主界面 = _GUI:创建根控件('主界面')
function 主界面:初始化()
	self.精灵 	= _资源:取精灵('02503.png')
	self.聊天框背景 = require("gge精灵类")(0,0,0,400,210)
	self.聊天框背景:置颜色(ARGB(120,0,0,0))
	self.输入框背景 = require("gge精灵类")(0,0,0,400,50)
	self.输入框背景:置颜色(ARGB(180,0,0,0))
end
function 主界面:显示(x,y)
	self.精灵:显示()
	self.聊天框背景:显示(0,535)
	self.输入框背景:显示(0,745)
end
--=============================================================================
local 信息层 = _GUI:创建根控件('信息层')
local 装备信息控件 = 信息层:创建控件('装备信息')
function 装备信息控件:初始化()
	self.背景 	= _资源:取精灵('04462.png')
	self.精灵 	= _资源:取精灵('item72 (3).png')
	self:置可视(false)
end
function 装备信息控件:显示(x,y)
	local x,y = self:取坐标()
	self.精灵:显示(x+20,y+144)
	self.背景:显示(x+20,y+144)
end
local 装备信息_背景 = 装备信息控件:创建自适应('装备信息_背景',0,0,350,400)
function 装备信息_背景:初始化()
	self:置左上纹理(_资源:取纹理('01366.png'))
	self:置右上纹理(_资源:取纹理('01364.png'))
	self:置左下纹理(_资源:取纹理('01368.png'))
	self:置右下纹理(_资源:取纹理('01362.png'))
	self:置上边纹理(_资源:取纹理('01365.png'))
	self:置下边纹理(_资源:取纹理('01369.png'))
	self:置左边纹理(_资源:取纹理('01367.png'))
	self:置右边纹理(_资源:取纹理('01363.png'))
	self:置中间纹理(_资源:取纹理('01361.png'))
end
local 装备信息_内容 = 装备信息控件:创建丰富文本("装备信息_内容",112,20,218,360)

function 装备信息_内容:初始化()
	self:置换行符('')
	self:添加元素("W",0xFFFFFFFF)
	self:添加元素("H",0xFF000000)
	self:添加元素("Y",0xFFFFFF00)
	self:添加元素("L",0xFF6060FF)
	self:添加元素("R",0xFFFF0000)
	self:添加元素("G",0xFF00FF00)
	self:添加元素("F",0xFFFF00E3)
	self:添加文本('#Y/jz/装备名称 (100)')
	self:添加文本('#R/jz/baidwwy大神 出品')
	self:添加文本('#W/装备信息信息信息信息信息信息信息信息信息信息信息信息信息')
	self:添加文本('#W/jz/装备等级:100')
	self:添加文本('#W/jz/装备性别:人妖')
	self:添加文本('#W/jz/装备门派:太白')
	self:添加文本('#W/jz/耐久度:无限/无限')
	self:添加文本('#L/jz/攻击力提升 + 100%')
	self:添加文本('#L/jz/攻击力提升 + 1000%')
	self:添加文本('#L/jz/攻击力提升 + 10000%')
	self:添加文本('#L/jz/攻击力提升 + 100000%')
	self:添加文本('#F/jz/逼值 + 10000%')
	self:添加文本('#F/jz/颜值 + 100000%')
	self:添加文本('#Y/jz/力量 + 10086')
	self:添加文本('#L/jz/改造伤害 + 3838438')
end


--=============================================================================
local 聊天框 = 主界面:创建丰富文本("聊天框")

function 聊天框:初始化()
	self:置坐标(5,540)
	self:添加元素("W",0xFFFFFFFF)
	self:添加元素("H",0xFF000000)
	self:添加元素("Y",0xFFFFFF00)
	self:添加元素("L",0xFF6060FF)
	self:添加元素("R",0xFFFF0000)
	self:添加元素("G",0xFF00FF00)
	self:添加文本('#G/欢迎光临！')
end
local 输入框 = 主界面:创建输入("输入框",0,748,400,16)

function 输入框:消息事件(a,b,c)
	if a == '输入字符' and c == 13 then
		聊天框:添加文本(self:取文本())
		self:置文本('')
	end
end
--======================================================================--
local 属性窗口 = 主界面:创建窗口('属性窗口')
function 属性窗口:初始化()
	self:置纹理(_资源:取纹理('03444.png'))
end
----------------------------------
local 属性窗口_关闭 = 属性窗口:创建按钮('属性窗口_关闭',330,0)
function 属性窗口_关闭:初始化()
	self:置正常纹理(_资源:取纹理('04623.png'))
	self:置按下纹理(_资源:取纹理('04624.png'))
	self:置经过纹理(_资源:取纹理('04625.png'))
end
----------------------------------
local 属性窗口_血条 = 属性窗口:创建进度('属性窗口_血条',79,246,243,15)
function 属性窗口_血条:初始化()
	self:置颜色(ARGB(125,255,0,0))
	self.i = 1
end
function 属性窗口_血条:更新()
	self.i = self.i +0.5
	if self.i >100 then
	    self.i = 1
	end
	self:置位置(self.i)
end
-----------------------------------
local 属性窗口_蓝条 = 属性窗口:创建进度('属性窗口_蓝条',79,266,243,15)
function 属性窗口_蓝条:初始化()
	self:置颜色(ARGB(125,0,0,255))
	self.i = 1
	self:置位置(50)
end
function 属性窗口_蓝条:更新()
	self.i = self.i +0.4
	if self.i >100 then
	    self.i = 1
	end
	self:置位置(self.i)
end
-----------------------------------
local 属性窗口_单选 = 属性窗口:创建控件('单选控件')
local 属性窗口_属性 = 属性窗口_单选:创建单选按钮("属性窗口_属性",25,213)

function 属性窗口_属性:初始化()
	self:置正常纹理(_资源:取纹理('03440.png'))
	self:置选中正常纹理(_资源:取纹理('03441.png'))
	self:置选中(true)
end
----------------------------------
local 属性窗口_抗性 = 属性窗口_单选:创建单选按钮("属性窗口_抗性",105,213)

function 属性窗口_抗性:初始化()
	self:置正常纹理(_资源:取纹理('03442.png'))
	self:置选中正常纹理(_资源:取纹理('03443.png'))
end
--======================================================================--
local 包裹窗口 = 主界面:创建窗口('包裹窗口')
function 包裹窗口:初始化()
	self:置纹理(_资源:取纹理('05441.png'))
end
--------------------------------------
local 包裹窗口_网格 = 包裹窗口:创建网格('包裹窗口_网格',32,63,190,230)
function 包裹窗口_网格:初始化()
	self:置格子宽高(32,32)
	self:置行列间距(7,7)
	self:置行列数(6,5)

	for i=1,12 do
		self:置内容(i,_资源:取纹理(string.format('item32 (%d).png',i)))
	end
end
function 包裹窗口_网格:消息事件(a,b,c)
	if a == '格子取消碰撞' then
		装备信息控件:置可视(false)
	elseif a == '格子碰撞' then
		装备信息控件:置坐标(self:取格子坐标(b))
		if b <=12 then
		    装备信息控件:置可视(true)
		end
	end
end
--======================================================================--
local 组队窗口 = 主界面:创建窗口('组队窗口')
function 组队窗口:初始化()
	self:置纹理(_资源:取纹理('03616.png'))
end
------------------------------------------
local 组队窗口_列表 = 组队窗口:创建多列表('组队窗口_列表',30,70,190,210)
function 组队窗口_列表:初始化()
	self:添加列(100,'名称')
	self:添加列(150,'等级')
	self:添加列(100,'门派')
	for i=1,100 do
		self:添加行('baidwwy'..i,100+i,'太白')
	end
end
--======================================================================--
local 好友窗口 = 主界面:创建窗口('好友窗口')
function 好友窗口:初始化()
	self:置纹理(_资源:取纹理('04047.png'))
end
local 好友窗口_关闭 = 好友窗口:创建按钮('好友窗口_关闭',200,0)
function 好友窗口_关闭:初始化()
	self:置正常纹理(_资源:取纹理('04623.png'))
	self:置按下纹理(_资源:取纹理('04624.png'))
	self:置经过纹理(_资源:取纹理('04625.png'))
end
-----------------------
local 好友窗口_列表
local 好友窗口_滑块 = 好友窗口:创建竖形滑块('好友窗口_滑块',210,90,10,345)
function 好友窗口_滑块:初始化()
	self:置正常纹理(_资源:取纹理('05319.png'))
	self:置按下纹理(_资源:取纹理('05320.png'))
	self:置经过纹理(_资源:取纹理('05321.png'))
	self:置滑块高度(34)
end
function 好友窗口_滑块:消息事件(a,b)
	if a == '位置改变' then
	    好友窗口_列表:滚动百分比(b)
	end
end
---------------------------------
local 好友窗口_滑块2 = 好友窗口:创建横形滑块('好友窗口_滑块2',10,50,210,16)
function 好友窗口_滑块2:初始化()
	self:置正常纹理(_资源:取纹理('03544.png'))
	self:置按下纹理(_资源:取纹理('03545.png'))
	self:置经过纹理(_资源:取纹理('03546.png'))
	self:置滑块宽度(42)
end

function 好友窗口_滑块2:显示()
	--self:取包围盒():显示()
end
-------------------------------
好友窗口_列表 = 好友窗口:创建列表('好友窗口_列表',15,75,190,380)
function 好友窗口_列表:初始化()
	for i=1,100 do
		self:添加('我的好友'..i)
	end
end
--======================================================================--
local 排行窗口 = 主界面:创建窗口('排行窗口')
function 排行窗口:初始化()
	self:置纹理(_资源:取纹理('05725.png'))
end
local 排行窗口_列表 = 排行窗口:创建树形('排行窗口_列表',30,75,120,370)
function 排行窗口_列表:初始化()
	self:置行距(5)
	local id = 0
	id = self:添加(0,"头盔列表",_资源:取纹理('05726.png'),_资源:取纹理('05729.png'))
		for i=1,10 do
			self:添加(id,i.."级",_资源:取纹理('05732.png'))
		end
	id = self:添加(0,"盔甲列表",_资源:取纹理('05726.png'),_资源:取纹理('05729.png'))
		for i=1,10 do
			self:添加(id,i.."级",_资源:取纹理('05732.png'))
		end
	id = self:添加(0,"一层",_资源:取纹理('05726.png'),_资源:取纹理('05729.png'))
		id = self:添加(id,"二层",_资源:取纹理('05726.png'),_资源:取纹理('05729.png'))
			id = self:添加(id,"三层",_资源:取纹理('05726.png'),_资源:取纹理('05729.png'))
				for i=1,10 do
					self:添加(id,i.."级",_资源:取纹理('05732.png'))
				end
end
--======================================================================--
local NPC窗口_窗体
local NPC窗口 = 主界面:创建窗口('NPC窗口')
function NPC窗口:初始化()
	self:置纹理(_资源:取纹理('15004_01_b.png'))
end
function NPC窗口:检查像素(x,y)
	return self:取精灵():取像素(x,y) ~= 0 or NPC窗口_窗体:检查点(x,y)
end
NPC窗口_窗体 = NPC窗口:创建自适应('NPC窗口_窗体',-5,230,500,200)
function NPC窗口_窗体:初始化()
	self:置左上纹理(_资源:取纹理('01366.png'))
	self:置右上纹理(_资源:取纹理('01364.png'))
	self:置左下纹理(_资源:取纹理('01368.png'))
	self:置右下纹理(_资源:取纹理('01362.png'))
	self:置上边纹理(_资源:取纹理('01365.png'))
	self:置下边纹理(_资源:取纹理('01369.png'))
	self:置左边纹理(_资源:取纹理('01367.png'))
	self:置右边纹理(_资源:取纹理('01363.png'))
	self:置中间纹理(_资源:取纹理('01361.png'))
end
local NPC窗口_内容 = NPC窗口:创建丰富文本("NPC窗口_内容",20,270,450,130)

function NPC窗口_内容:初始化()
	self:置行距(5)
	self:添加元素("W",0xFFFFFFFF)
	self:添加元素("H",0xFF000000)
	self:添加元素("Y",0xFFFFFF00)
	self:添加元素("L",0xFF6060FF)
	self:添加元素("R",0xFFFF0000)
	self:添加元素("G",0xFF00FF00)
	self:添加文本('#W/我这里的#R/药材#W/应有尽有，客官需要什么尽管吩咐！')
	self:添加文本('#G/xx/pz|R/ht|1/来点春药。')
	self:添加文本('#G/xx/pz|R/ht|2/什么也不需要。')
end

local 编辑窗口 = 主界面:创建窗口('编辑窗口')
function 编辑窗口:初始化()
	self:置纹理(_资源:取纹理('04022.png'))
end

return 主界面